app/controllers/links_controller.rb

SELECT  "links".* FROM "links"  ORDER BY averageprice LIMIT 5
---
  def index
    @q = Link.ransack(@temp)
    @links = @q.result(distinct: true)

    @topfive = Link.order('averageprice').limit(5)